Klipper3d/klipper/lib/asf/sam/utils/cmsis/sams70/include/sams70.h
/**
 * \file
 *
 * Copyright (c) 2015-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */
/*
 * Support and FAQ: visit <a href="https://www.microchip.com/support/">Microchip Support</a>
 */
#ifndef _SAMS70_
#define _SAMS70_

#if defined (__SAMS70J19__)
#include "sams70j19.h"
#elif defined (__SAMS70J20__)
#include "sams70j20.h"
#elif defined (__SAMS70J21__)
#include "sams70j21.h"
#elif defined (__SAMS70N19__)
#include "sams70n19.h"
#elif defined (__SAMS70N20__)
#include "sams70n20.h"
#elif defined (__SAMS70N21__)
#include "sams70n21.h"
#elif defined (__SAMS70Q19__)
#include "sams70q19.h"
#elif defined (__SAMS70Q20__)
#include "sams70q20.h"
#elif defined (__SAMS70Q21__)
#include "sams70q21.h"
#elif defined (__SAMS70J19B__)
#include "sams70j19b.h"
#elif defined (__SAMS70J20B__)
#include "sams70j20b.h"
#elif defined (__SAMS70J21B__)
#include "sams70j21b.h"
#elif defined (__SAMS70N19B__)
#include "sams70n19b.h"
#elif defined (__SAMS70N20B__)
#include "sams70n20b.h"
#elif defined (__SAMS70N21B__)
#include "sams70n21b.h"
#elif defined (__SAMS70Q19B__)
#include "sams70q19b.h"
#elif defined (__SAMS70Q20B__)
#include "sams70q20b.h"
#elif defined (__SAMS70Q21B__)
#include "sams70q21b.h"
#else
  #error Library does not support the specified device.
#endif

#endif /* _SAMS70_ */
